requests/invalidUserRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://backend.com/soap/web/users">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:addUserRequest>
            <gs:userTO>
                <gs:name></gs:name>
                <gs:login></gs:login>
                <gs:password></gs:password>
                <gs:role>Operator</gs:role>
                <gs:role>Engineer</gs:role>
            </gs:userTO>
        </gs:addUserRequest>
    </soapenv:Body>
</soapenv:Envelope>